<h1>Pandas introduction

In [1]:
import pandas as pd 
import numpy as np

In [2]:
#millions
g7_population = pd.Series([35.467,63.951,80.940,64.955,67.853,45.943,36.959,])

In [3]:
g7_population

0    35.467
1    63.951
2    80.940
3    64.955
4    67.853
5    45.943
6    36.959
dtype: float64

In [5]:
g7_population.name = 'G7_Population'
g7_population

0    35.467
1    63.951
2    80.940
3    64.955
4    67.853
5    45.943
6    36.959
Name: G7_Population, dtype: float64

In [6]:
g7_population.dtype

dtype('float64')

In [8]:
g7_population.values

array([35.467, 63.951, 80.94 , 64.955, 67.853, 45.943, 36.959])

In [9]:
g7_population.index = ['USA','France','Germany','Italy','Japan','United Kingdom','China']

In [10]:
g7_population

USA               35.467
France            63.951
Germany           80.940
Italy             64.955
Japan             67.853
United Kingdom    45.943
China             36.959
Name: G7_Population, dtype: float64

<h2>First case of Pandas

In [11]:
g7_population['USA']

35.467

In [12]:
g7_population[['USA','France']]

USA       35.467
France    63.951
Name: G7_Population, dtype: float64

In [15]:
g7_population[0:-1]

USA               35.467
France            63.951
Germany           80.940
Italy             64.955
Japan             67.853
United Kingdom    45.943
Name: G7_Population, dtype: float64

In [16]:
g7_population.mean()

56.58114285714286

In [17]:
g7_population.median()

63.951

In [18]:
g7_population[g7_population > g7_population.mean()]

France     63.951
Germany    80.940
Italy      64.955
Japan      67.853
Name: G7_Population, dtype: float64

<h1 style='color:green'>Panda dataframes

In [19]:
df = pd.DataFrame({'A':[1,2,3,4,5,6,7,8,9,10],'B':[1,2,3,4,5,6,7,8,9,10],'C':[1,2,3,4,5,6,7,8,9,10]})

In [20]:
df

    A   B   C
0   1   1   1
1   2   2   2
2   3   3   3
3   4   4   4
4   5   5   5
5   6   6   6
6   7   7   7
7   8   8   8
8   9   9   9
9  10  10  10

In [21]:
df.index = ['a','b','c','d','e','f','g','h','i','j']

In [22]:
df

    A   B   C
a   1   1   1
b   2   2   2
c   3   3   3
d   4   4   4
e   5   5   5
f   6   6   6
g   7   7   7
h   8   8   8
i   9   9   9
j  10  10  10

In [23]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     int64
 1   B       10 non-null     int64
 2   C       10 non-null     int64
dtypes: int64(3)
memory usage: 320.0+ bytes

In [30]:
df.size

30